using System.Diagnostics;
using System.Drawing;
using System.Linq.Expressions;

namespace MyNamespace
{
    class Program
    {
        static void Main(string[] args)
        {
            //Проверка есть ли слово в заготовленном массиве(50 слов)
            string[] words = {  "облако", "бежать", "синий", "музыка", "тишина",
                "огонь", "книга", "смеяться", "холодный", "дорога",
                "звезда", "писать", "вкусный", "ветер", "мечта",
                "камень", "танцевать", "яркий", "река", "счастье",
                "зеркало", "думать", "мягкий", "лес", "время",
                "ключ", "кричать", "старый", "море", "свобода",
                "тень", "рисовать", "горячий", "город", "тайна",
                "цветок", "слушать", "быстрый", "небо", "энергия",
                "стол", "падать", "зелёный", "песня", "история",
                "дождь", "искать", "тёмный", "солнце", "момент", "банан"};
            string word_find = "банан";
            var sorted = words.OrderBy(w => char.ToLower(w[^1])).ToArray();
            Console.WriteLine(string.Join("\n", sorted));

            bool found = words.Contains(word_find);

            if (found)
            {
                Console.WriteLine("слово есть");
            }
            else
            {
                Console.WriteLine("такого слова нет");
            }
            
        }
    }
}

/*1.  //Проверка есть ли слово в заготовленном массиве(50 слов)
2. Проверка аннограмы из всего массива вводимым пользователем. Возвращает все аннограмы
3.Сортировка по последней букве*/
